RuPingCen/mick_robot_chasiss/STM32_Code/User/bsp_uart/bsp_uart.c
 /*******************************************************************************
* 参数说明：  USARTx: USART1, USART2, USART3, UART4 or UART5. 
*    					u32_Baud: 串口波特率（9600 、115200  等）    					 
*             UART_IT_EN： 串口中断使能位 0：禁止串口接收中断
*                                         1：允许串口接收中断 
*
*    					DMA_send_data： DMA数据发送的首地址 
*             u32DMA_size : 单次发送数据的个数 （也就是数组的长度）
*             DMA_send_priority ：DMA优先级（0、1、2、3）  0的优先级最高    
*             USART_DMAReq ： USART_DMAReq_Tx （发送） 或  USART_DMAReq_Rx （接收）
*
* 备注：     	  " PA9 - USART1(Tx)    PA10 - USART1(Rx) "
*                 " PA2 - USART2_TX     PA3 - USART2_RX   "
*				  " PB10 - USART3_TX    PB11 - USART3_RX  "
*				  " PC10 - UART4_TX     PC11 - UART4_RX   "
*				  " PC12 - UART5_TX     PD2  - UART5_RX   "
*  串口1的最大传输速率可达到4.5Mbit/s  串口2~5最大传送速率为 2.25Mbit/s


 void My_Config_USART_Init(USART_TypeDef* USARTx,unsigned int u32_Baud , unsigned char UART_IT_EN);//串口初始化函数

 void UART_send_string(USART_TypeDef* USARTx,char *buf);//字符串函数
 void UART_send_char(USART_TypeDef* USARTx,char buf); //USART1~UART5  字符发送函数
 void UART_send_data(USART_TypeDef* USARTx,unsigned int u32tempdat);  // 0~4294967296
 void UART_send_intdata(USART_TypeDef* USARTx,int u32tempdat); //-2147483648~2147483647
 void UART_send_floatdat(USART_TypeDef* USARTx,float floatempdat);//浮点数发送函数 精确到小数点后三位
 
  //串口DMA传输配置函数
 void USART_DMA_Config(USART_TypeDef* USARTx,unsigned char DMA_send_data[],unsigned int u32DMA_size,unsigned char DMA_send_priority);
 //串口DMA传输启动函数
 void USART_DMACmd(USART_TypeDef* USARTx, uint16_t USART_DMAReq, FunctionalState NewState);  
 
 
 //串口DMA接收固定长度的数据
 
 
 
 
   * 备注：     串口DMA只有通道1~4才有    串口5没有DMA
 ********************************************************************************/
 
#include "stm32f10x.h"
#include "bsp_uart.h" 



uint8_t USART_RX_BUF[USART_REC_LEN];     //接收缓冲,最大USART_REC_LEN个字节





 /****************************************************************
  *
  * 函数名：    My_Config_USART_Init
	* 函数功能：  串口初始换函数
  *
  * 参数说明：  USARTx:  USART1, USART2, USART3, UART4 or UART5.
	*
  *    					u32_Baud: 串口波特率（9600 、115200  等）  
  *    					 
	*             UART_IT_EN： 串口中断使能位 0：禁止串口接收中断
  *                                         1：允许串口接收中断 
  *   
  * 备注：  CRP   	" PA9 - USART1(Tx)    PA10 - USART1(Rx) "
	*                 " PA2 - USART2_TX     PA3 - USART2_RX   "
	*									" PB10 - USART3_TX    PB11 - USART3_RX  "
	*								  " PC10 - UART4_TX     PC11 - UART4_RX   "
	*									" PC12 - UART5_TX     PD2  - UART5_RX   "
  *  串口1的最大传输速率可达到4.5Mbit/s  串口2~5最大传送速率为 2.25Mbit/s
  ****************************************************************/
void My_Config_USART_Init(USART_TypeDef* USARTx,unsigned int u32_Baud , unsigned char UART_IT_EN)
{
      if(USARTx == USART1)
			{
         USART1_Config(u32_Baud ,UART_IT_EN);
      }
			else if(USARTx == USART2)
			{
        USART2_Config(u32_Baud ,UART_IT_EN);
      }
			else if(USARTx == USART3)
			{
        USART3_Config(u32_Baud ,UART_IT_EN);
      }
			else if(USARTx == UART4)
			{
        UART4_Config(u32_Baud ,UART_IT_EN);
      }
			else if(USARTx == UART5)
			{
        UART5_Config(u32_Baud ,UART_IT_EN);
      }
			else  
			{
					while(1);
      }

}


/****************************************************************
  *
  * 函数名：   USART1_Config
	* 函数功能： 串口模块一初始化函数
  *
  * 参数说明：  u32_Baud: 串口波特率（9600 、115200  等）  
  *    					 
	*             UART_IT_EN： 串口中断使能位 0：禁止串口接收中断
  *                                         1：允许串口接收中断
  * 备注： CRP
  *  
  ****************************************************************/
void USART1_Config(unsigned int u32_Baud , unsigned char UART_IT_EN)
{
		GPIO_InitTypeDef GPIO_InitStructure;
		USART_InitTypeDef USART_InitStructure;
		
		/* config USART1 clock */
	 
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1 | RCC_APB2Periph_GPIOA, ENABLE);
		
		/* USART1 GPIO config */
		/* Configure USART1 Tx (PA.09) as alternate function push-pull */
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
		GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
		GPIO_Init(GPIOA, &GPIO_InitStructure);
	
		/* Configure USART1 Rx (PA.10) as input floating */
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
		GPIO_Init(GPIOA, &GPIO_InitStructure);
			
		/* USART1 mode config 115200*/
		USART_InitStructure.USART_BaudRate =u32_Baud ;
		USART_InitStructure.USART_WordLength = USART_WordLength_8b;
		USART_InitStructure.USART_StopBits = USART_StopBits_1;
		USART_InitStructure.USART_Parity = USART_Parity_No ;
		USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
		USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
		USART_Init(USART1, &USART_InitStructure); //
		if(UART_IT_EN==1)
		{
			  USART1_NVIC_Configuration();
        USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);/* 使能串口1接收中断 */
    }
		else 
			  USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);/*禁止串口1接收中断 */
	 
		USART_Cmd(USART1, ENABLE);//
}

void USART1_NVIC_Configuration(void)/// 配置USART1接收中断
{
	NVIC_InitTypeDef NVIC_InitStructure; 
	/* Configure the NVIC Preemption Priority Bits */  
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_0);//选着中断组
	
	/* Enable the USARTy Interrupt */
	NVIC_InitStructure.NVIC_IRQChannel = USART1_IRQn;	 //中断源
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;//抢占式优先级
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;//相应优先级
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);
	
}

/****************************************************************
  *
  * 函数名：   USART2_Config
	* 函数功能： 串口模块2初始化函数
  *
  * 参数说明：  u32_Baud: 串口波特率（9600 、115200  等）  
  *    					 
	*             UART_IT_EN： 串口中断使能位 0：禁止串口接收中断
  *                                         1：允许串口接收中断
  * 备注： CRP
  *  
  ****************************************************************/
void USART2_Config(unsigned int u32_Baud , unsigned char UART_IT_EN)
{
		GPIO_InitTypeDef GPIO_InitStructure;
		USART_InitTypeDef USART_InitStructure;
		
		/* config USART1 clock */
	 
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);//使能端口时钟
	  RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);//使能串口二模块时钟
 
		/* USART1 GPIO config */
		/* Configure USART2 Tx (PA.02) as alternate function push-pull */
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;//设置引脚模式
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
		GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
		GPIO_Init(GPIOA, &GPIO_InitStructure);
	
