RuPingCen/mick_robot_chasiss/STM32_Code/User/bsp_uart/bsp_uart.c
		/* Configure USART2 Rx (PA.03) as input floating */
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
		GPIO_Init(GPIOA, &GPIO_InitStructure);
			
		/* USART2 mode config 115200*/
		USART_InitStructure.USART_BaudRate =u32_Baud ;//配置串口数据发送信息
		USART_InitStructure.USART_WordLength = USART_WordLength_8b;
		USART_InitStructure.USART_StopBits = USART_StopBits_1;
		USART_InitStructure.USART_Parity = USART_Parity_No ;
		USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
		USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
		USART_Init(USART2, &USART_InitStructure); //
					
	  if(UART_IT_EN==1)
		{
				USART2_NVIC_Configuration();
        USART_ITConfig(USART2, USART_IT_RXNE, ENABLE);/* 使能串口2接收中断 */
    }
		else 
			  USART_ITConfig(USART2, USART_IT_RXNE, DISABLE);/*禁止串口2接收中断 */
		USART_Cmd(USART2, ENABLE);//
}
void USART2_NVIC_Configuration(void)/// 配置USART2接收中断
{
	NVIC_InitTypeDef NVIC_InitStructure; 
	/* Configure the NVIC Preemption Priority Bits */  
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_0);//选着中断组
	
	/* Enable the USARTy Interrupt */
	NVIC_InitStructure.NVIC_IRQChannel = USART2_IRQn;	 //中断源
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;//抢占式优先级
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 2;//相应优先级
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);
	
}
/****************************************************************
  *
  * 函数名：   USART3_Config
	* 函数功能： 串口模块3初始化函数
  *
  * 参数说明：  u32_Baud: 串口波特率（9600 、115200  等）  
  *    					 
	*             UART_IT_EN： 串口中断使能位 0：禁止串口接收中断
  *                                         1：允许串口接收中断
  *
  * 引脚说明： PB10   USART3_TX    PB11 USART3_RX
  * 备注： CRP
  *  
  ****************************************************************/
void USART3_Config(unsigned int u32_Baud , unsigned char UART_IT_EN)
{
		GPIO_InitTypeDef GPIO_InitStructure;
		USART_InitTypeDef USART_InitStructure;
		
		/* config USART1 clock */
	 
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);//使能端口时钟
	  RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3, ENABLE);//使能串口3模块时钟
 
		/* USART3 GPIO config */
		/* Configure USART3 Tx (PB.10) as alternate function push-pull */
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;//设置引脚模式
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
		GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
		GPIO_Init(GPIOB, &GPIO_InitStructure);
	
		/* Configure USART3 Rx (PA.11) as input floating */
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
		GPIO_Init(GPIOB, &GPIO_InitStructure);
			
		/* USART3 mode config u32_Baud*/
		USART_InitStructure.USART_BaudRate =u32_Baud ;//配置串口数据发送信息
		USART_InitStructure.USART_WordLength = USART_WordLength_8b;
		USART_InitStructure.USART_StopBits = USART_StopBits_1;
		USART_InitStructure.USART_Parity = USART_Parity_No ;
		USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
		USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
		USART_Init(USART3, &USART_InitStructure); //
					
	  if(UART_IT_EN==1)
		{
			  USART3_NVIC_Configuration();
        USART_ITConfig(USART3, USART_IT_RXNE, ENABLE);/* 使能串口3接收中断 */
    }
		else 
			  USART_ITConfig(USART3, USART_IT_RXNE, DISABLE);/*禁止串口3接收中断 */
		USART_Cmd(USART3, ENABLE);//
}
void USART3_NVIC_Configuration(void)/// 配置USART3接收中断
{
	NVIC_InitTypeDef NVIC_InitStructure; 
	/* Configure the NVIC Preemption Priority Bits */  
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_0);//选着中断组
	
	/* Enable the USARTy Interrupt */
	NVIC_InitStructure.NVIC_IRQChannel = USART3_IRQn;	 //中断源
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;//抢占式优先级
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 3;//相应优先级
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);
	
}
/****************************************************************
  *
  * 函数名：   UART4_Config
	* 函数功能： 串口模块4初始化函数
  *
  * 参数说明：  u32_Baud: 串口波特率（9600 、115200  等）  
  *    					 
	*             UART_IT_EN： 串口中断使能位 0：禁止串口接收中断
  *                                         1：允许串口接收中断
  *
  * 引脚说明： PC10   UART4_TX    PC11 UART4_RX 
  * 备注： CRP
  *  
  ****************************************************************/
void UART4_Config(unsigned int u32_Baud , unsigned char UART_IT_EN)
{
		GPIO_InitTypeDef GPIO_InitStructure;
		USART_InitTypeDef USART_InitStructure;
		
		/* config UART4 clock */
	 
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);//使能端口时钟
	  RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART4, ENABLE);//使能串口4模块时钟
 
		/* USART3 GPIO config */
		/* Configure USART4 Tx (PC.10) as alternate function push-pull */
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;//设置引脚模式
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
		GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
		GPIO_Init(GPIOC, &GPIO_InitStructure);
	
		/* Configure USART4 Rx (PC.11) as input floating */
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
		GPIO_Init(GPIOC, &GPIO_InitStructure);
			
		/* USART3 mode config u32_Baud*/
		USART_InitStructure.USART_BaudRate =u32_Baud ;//配置串口数据发送信息
		USART_InitStructure.USART_WordLength = USART_WordLength_8b;
		USART_InitStructure.USART_StopBits = USART_StopBits_1;
		USART_InitStructure.USART_Parity = USART_Parity_No ;
		USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
		USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
		USART_Init(UART4, &USART_InitStructure); //
					
	  if(UART_IT_EN==1)
		{
			  USART4_NVIC_Configuration();
        USART_ITConfig(UART4, USART_IT_RXNE, ENABLE);/* 使能串口4接收中断 */
    }
		else 
			  USART_ITConfig(UART4, USART_IT_RXNE, DISABLE);/*禁止串口4接收中断 */
		USART_Cmd(UART4, ENABLE);//
}
void USART4_NVIC_Configuration(void)/// 
{
	NVIC_InitTypeDef NVIC_InitStructure; 
	/* Configure the NVIC Preemption Priority Bits */  
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_0);//选着中断组
	
	/* Enable the USARTy Interrupt */
//	NVIC_InitStructure.NVIC_IRQChannel = UART4_IRQn;	 //中断源
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;//抢占式优先级
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 4;//相应优先级
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);
	
