RuPingCen/mick_robot_chasiss/STM32_Code/User/bsp_uart/bsp_uart.c
}
/****************************************************************
  *
  * 函数名：   UART5_Config
	* 函数功能： 串口模块5初始化函数
  *
  * 参数说明：  u32_Baud: 串口波特率（9600 、115200  等）  
  *    					 
	*             UART_IT_EN： 串口中断使能位 0：禁止串口接收中断
  *                                         1：允许串口接收中断
  *
  * 引脚说明： PC12   USART5_TX    PD2  USART5_RX
  * 备注： CRP
  *  
  ****************************************************************/
void UART5_Config(unsigned int u32_Baud , unsigned char UART_IT_EN)
{
		GPIO_InitTypeDef GPIO_InitStructure;
		USART_InitTypeDef USART_InitStructure;
		
		/* config UART5 clock */
	  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOD, ENABLE);//使能端口时钟
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);//使能端口时钟
	  RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART5, ENABLE);//使能串口5模块时钟
 
		/* USART5 GPIO config */
		/* Configure USART5 Tx (PC.12) as alternate function push-pull */
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_12;//设置引脚模式
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
		GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
		GPIO_Init(GPIOC, &GPIO_InitStructure);
	
		/* Configure USART5 Rx (PD.02) as input floating */
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
		GPIO_Init(GPIOD, &GPIO_InitStructure);
			
		/* USART5 mode config u32_Baud*/
		USART_InitStructure.USART_BaudRate =u32_Baud ;//配置串口数据发送信息
		USART_InitStructure.USART_WordLength = USART_WordLength_8b;
		USART_InitStructure.USART_StopBits = USART_StopBits_1;
		USART_InitStructure.USART_Parity = USART_Parity_No ;
		USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
		USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
		USART_Init(UART5, &USART_InitStructure); //
					
	  if(UART_IT_EN==1)
		{
			  USART5_NVIC_Configuration();
        USART_ITConfig(UART5, USART_IT_RXNE, ENABLE);/* 使能串口5接收中断 */
    }
		else 
			  USART_ITConfig(UART5, USART_IT_RXNE, DISABLE);/*禁止串口5接收中断 */
		USART_Cmd(UART5, ENABLE);//
}
void USART5_NVIC_Configuration(void)///  
{
	NVIC_InitTypeDef NVIC_InitStructure; 
	/* Configure the NVIC Preemption Priority Bits */  
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_0);//选着中断组
	
	/* Enable the USARTy Interrupt */
//	NVIC_InitStructure.NVIC_IRQChannel = UART5_IRQn;	 //中断源
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;//抢占式优先级
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 5;//相应优先级
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);
	
}

/****************************************************************
  *
  * 函数名：   USART_DMA_Config
	* 函数功能： 串口模块DMA配置函数
  *
  * 参数说明：  USARTx: USART1, USART2, USART3, UART4 or UART5. 
  *    					DMA_send_data： DMA数据发送的首地址 
	*             u32DMA_size : 单次发送数据的个数 （也就是数组的长度）
  *             DMA_send_priority ：DMA优先级（0、1、2、3）  0的优先级最高    
  *              
  * 备注： CRP    串口DMA只有通道1~4才有    串口5没有DMA
  *  
  ****************************************************************/
 
void USART_DMA_Send_Config(USART_TypeDef* USARTx,unsigned char DMA_send_data[],unsigned int u32DMA_size,unsigned char DMA_send_priority)
{
		DMA_InitTypeDef DMA_InitStructure;		//数据方向-------从内存读取数据传送到外部串口
		NVIC_InitTypeDef NVIC_InitStructure;
	
	
		//DMA_InitStructure.DMA_PeripheralBaseAddr = USART1_DR_Base;/*设置DMA传送的目的地址：串口数据寄存器地址*/	   	
		DMA_InitStructure.DMA_MemoryBaseAddr = (u32)DMA_send_data;/*ＤＭＡ传送的源地址：内存地址(要传输的变量的指针)*/		
		DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralDST;/*方向：从内存到外设*/			
		DMA_InitStructure.DMA_BufferSize = u32DMA_size;	/*传输大小DMA_BufferSize=SENDBUFF_SIZE*/	
		DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;/*外设地址不增*/	 
		DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;/*内存地址自增*/	

		DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;	/*外设数据单位*/	
		DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;		/*内存数据单位 8bit*/ 
	
		DMA_InitStructure.DMA_Mode = DMA_Mode_Normal ;//normal 是指发送完一次就不在发送
		//DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;/*DMA模式：不断循环*/
   if(DMA_send_priority==0)
	 {
      DMA_InitStructure.DMA_Priority = DMA_Priority_VeryHigh; 	/*优先级：最高*/	 		
   }
	 else if(DMA_send_priority==1)
	 {
      DMA_InitStructure.DMA_Priority = DMA_Priority_High; 	/*优先级：高*/	 	
   }
	 else if(DMA_send_priority==2)
	 {
      DMA_InitStructure.DMA_Priority = DMA_Priority_Medium; 	/*优先级： 中*/	 	
   }
		
	 else if(DMA_send_priority==3)
	 {
      DMA_InitStructure.DMA_Priority = DMA_Priority_Low; 	/*优先级 低 */	 	
   }
	 
	 DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;/*禁止内存到内存的传输	*/ 
	 
	 
	 if (USARTx == USART1)
		{			
			DMA_InitStructure.DMA_PeripheralBaseAddr = USART1_DR_Base;/*设置DMA传送的目的地址：串口数据寄存器地址*/	
			RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);/*开启DMA时钟*/		
		
		 	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_1);
			NVIC_InitStructure.NVIC_IRQChannel = DMA1_Channel4_IRQn;
			NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
			NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
			NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
			NVIC_Init(&NVIC_InitStructure);
			
			DMA_ITConfig(DMA1_Channel4,DMA_IT_TC,ENABLE);  //配置DMA发送完成后产生中断
			
			DMA_Init(DMA1_Channel4, &DMA_InitStructure);/*配置DMA1的4通道*/	
			DMA_Cmd (DMA1_Channel4,ENABLE);/*使能DMA*/
		}
		else if (USARTx == USART2)
		{ 
			  DMA_InitStructure.DMA_PeripheralBaseAddr = USART2_DR_Base;/*设置DMA传送的目的地址：串口数据寄存器地址*/	
			 RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);/*开启DMA时钟*/		
			 DMA_Init(DMA1_Channel7, &DMA_InitStructure);/*配置DMA1的7通道*/		   	   
			 DMA_Cmd (DMA1_Channel7,ENABLE);/*使能DMA*/					
		 //DMA_ITConfig(DMA1_Channel7,DMA_IT_TC,ENABLE);  //配置DMA发送完成后产生中断
		}
		else if (USARTx == USART3)
		{
			 DMA_InitStructure.DMA_PeripheralBaseAddr = USART3_DR_Base;/*设置DMA传送的目的地址：串口数据寄存器地址*/	
			 RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);/*开启DMA时钟*/		
			 DMA_Init(DMA1_Channel2, &DMA_InitStructure);/*配置DMA1的2通道*/		   	   
			 DMA_Cmd (DMA1_Channel2,ENABLE);/*使能DMA*/					
		 //DMA_ITConfig(DMA1_Channel3,DMA_IT_TC,ENABLE);  //配置DMA发送完成后产生中断
		}    
		else if (USARTx == UART4)
		{
			 DMA_InitStructure.DMA_PeripheralBaseAddr = USART4_DR_Base;/*设置DMA传送的目的地址：串口数据寄存器地址*/	
			 RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA2, ENABLE);/*开启DMA时钟*/		
			 DMA_Init(DMA2_Channel5, &DMA_InitStructure);/*配置DMA2的5通道*/		   	   
			 DMA_Cmd (DMA2_Channel5,ENABLE);/*使能DMA*/					
		 //DMA_ITConfig(DMA1_Channel5,DMA_IT_TC,ENABLE);  //配置DMA发送完成后产生中断
		}      
		else ;
   
	 
