RuPingCen/mick_robot_chasiss/STM32_Code/User/bsp_uart/bsp_uart.c
}















/****************************************************************
  *
  * 函数名：   USART_DMA_Rec_Config
	* 函数功能： 串口模块DMA接收固定长度数据配置函数
  *
  * 参数说明：  USARTx: USART1, USART2, USART3, UART4 . 
  *    					u32_Baud 波特率  
  *              
  * 备注： CRP    串口DMA只有通道1~4才有    串口5没有DMA
	* 
  *        串口1接收，应该用DMA1的通道5  DMA1_Channel5_IRQn。
  ****************************************************************/
 
void USART_DMA_Rec_Config(USART_TypeDef* USARTx,unsigned int u32_Baud,unsigned char lendat)
{
	  DMA_InitTypeDef DMA_InitStructure;
	  NVIC_InitTypeDef NVIC_InitStructure;
	
	
		USART1_Config(u32_Baud ,0);
	
		USART_Cmd(USART1, DISABLE);                    //使能串口1
		USART_ITConfig(USART1, USART_IT_IDLE, DISABLE);//关闭串口接受中断
		USART_DMACmd(USART1,USART_DMAReq_Rx,ENABLE);//使能DMA接收
		USART_Cmd(USART1, ENABLE);                    //使能串口1
	   
	
	  RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE); //DMA1 时钟使能
	  DMA_DeInit(DMA1_Channel5);//将DMA的通道5寄存器重设为缺省值  串口1对应的是DMA通道5(接收)
	  DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)&USART1->DR;//DMA外设UASRT1->DR基地址
    DMA_InitStructure.DMA_MemoryBaseAddr = (u32)USART_RX_BUF;//DMA内存基地址
    DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;//DMA方向  外设->内存
    DMA_InitStructure.DMA_BufferSize = lendat;//sizeof(USART_RX_BUF);//DMA通道的DMA缓存的大小
    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;//外设地址不增加
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;//内存地址自增1
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;//数据宽度为8位
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;//数据宽度为8位
    DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;//DMA_Mode_Normal（只传送一次）, DMA_Mode_Circular （不停地传送）
    
    DMA_InitStructure.DMA_Priority = DMA_Priority_Medium;//(DMA传送优先级为中等)
    DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;//DMA通道x没有设置为内存到内存传输
    DMA_Init(DMA1_Channel5, &DMA_InitStructure);//初始化DMA1 通道5
    DMA_Cmd(DMA1_Channel5, ENABLE);  //启动DMA传输
	
	  //DMA发送中断配置
	  NVIC_InitStructure.NVIC_IRQChannel = DMA1_Channel5_IRQn;
	  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority=2;//抢占优先级3
	  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 3;		//子优先级3
	  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;			//IRQ通道使能
	  NVIC_Init(&NVIC_InitStructure);	//根据指定的参数初始化VIC寄存器 	
		
		DMA_ITConfig(DMA1_Channel5, DMA_IT_TC, ENABLE);//使能DMA传输完成中断
 
}
// 配置DMA串口引脚 与普通模式相同
void USART1_DMA_Rec_Config(unsigned int u32_Baud)
{

  //GPIO端口设置
  GPIO_InitTypeDef GPIO_InitStructure;
	USART_InitTypeDef USART_InitStructure;
	NVIC_InitTypeDef NVIC_InitStructure;
	 
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1|RCC_APB2Periph_GPIOA, ENABLE);	//使能 USART1，GPIOA时钟
  
	//USART1_TX   GPIOA.9
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9; //PA.9
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;	//复用推挽输出
  GPIO_Init(GPIOA, &GPIO_InitStructure);//初始化GPIOA.9
   
  //USART1_RX	  GPIOA.10初始化
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;//PA10
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;//浮空输入
  GPIO_Init(GPIOA, &GPIO_InitStructure);//初始化GPIOA.10  
 
  //Usart1 NVIC 配置
  NVIC_InitStructure.NVIC_IRQChannel = USART1_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority=3 ;//抢占优先级3
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 3;		//子优先级3
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;			//IRQ通道使能
	NVIC_Init(&NVIC_InitStructure);	//根据指定的参数初始化VIC寄存器
  
   //USART 初始化设置
	USART_InitStructure.USART_BaudRate = u32_Baud;//串口波特率
	USART_InitStructure.USART_WordLength = USART_WordLength_8b;//字长为8位数据格式
	USART_InitStructure.USART_StopBits = USART_StopBits_1;//一个停止位
	USART_InitStructure.USART_Parity = USART_Parity_No;//无奇偶校验位
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;//无硬件数据流控制
	USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;	//收发模式
 
  USART_Init(USART1, &USART_InitStructure); //初始化串口1
 // USART_ITConfig(USART1, USART_IT_IDLE, ENABLE);//开启串口接受中断
	USART_DMACmd(USART1,USART_DMAReq_Rx,ENABLE);//使能DMA接收
  USART_Cmd(USART1, ENABLE);                    //使能串口1
 
}	



/****************************************************************
  *
  * 函数名：   UART_send_floatdat
	* 函数功能： 浮点数据发送函数 精确到小数点后三位
  *
  * 参数说明：  USARTx:  
  *    					USART1, USART2, USART3, UART4 or UART5.
	*             floatempdat： 
  *   
  * 备注： CRP
  *  
  ****************************************************************/
void UART_send_floatdat(USART_TypeDef* USARTx,float floatempdat)
{ 
//      int m,n;
//      float R;
//	    char chartemp[5];
//      R=floatempdat;
//      m=R/1;
//      n=(R-m)*1000; if(n<0) n=-n;
//	
//      UART_send_intdata(USARTx,m);
//      UART_send_char (USARTx,'.');
//	    chartemp[0]=n/100+48;
//	    chartemp[1]=n/10%10+48;
//	    chartemp[2]=n%10+48;
//	    chartemp[3]=' ';
//	    chartemp[4]='\0';
//      UART_send_string(USARTx,chartemp);
//	
			int n,m;
			float dat=floatempdat;
			m=dat/1;
			UART_send_intdata(USARTx,m);
			UART_send_char(USARTx, '.');
			n=((dat-m)*1000)/1;
			if(n<0) n=-n;
			if(n<10)
			{
				UART_send_char(USARTx, '0');
				UART_send_char(USARTx, '0');
				UART_send_data(USARTx,n);
			}
			else if(n<100)
			{
				UART_send_char(USARTx, '0');
				UART_send_data(USARTx,n);
			}
			else if(n<1000)
			{
					UART_send_data(USARTx,n);
			}
 
}

  /****************************************************************
  *
  * 函数名：   UART_send_intdata
	* 函数功能： 带符号整形数据发送函数 
  *
  * 参数说明：  USARTx:  
  *    					USART1, USART2, USART3, UART4 or UART5.
	*             u32tempdat：-2147483648~2147483647
  *   
  * 备注：  CRP
  *  
  ****************************************************************/
void UART_send_intdata(USART_TypeDef* USARTx,int u32tempdat) //USART1~UART5   u32tempdat：-2147483648~2147483647
{
	  unsigned char temp[11],i;
		unsigned int gg;
	 if(u32tempdat < 0)
	 {
				u32tempdat=u32tempdat*(-1);
		    UART_send_char( USARTx,'-');
		 
	 }
		gg=u32tempdat;
	  temp[0]='\0';//为了符合字符串输出函数结束符
	  i=1;		
		while((gg/10) != 0)
		{
				 temp[i]=gg%10+48;
				 gg=gg/10;
				 i++;
		}
	 temp[i]=gg%10+48; //ASCALL character code conversion  
	
	 for(;i>0;i--)
	 {
	     UART_send_char( USARTx,temp[i]);
   }
}

 
 /****************************************************************
  *
  * 函数名：   UART_send_data
	* 函数功能： 无符号整形数据发送函数 
  *
  * 参数说明：  USARTx:  
  *    					USART1, USART2, USART3, UART4 or UART5.
	*             u32tempdat：0~4294967296
  *   
  * 备注： CRP
  *  
  ****************************************************************/
void UART_send_data(USART_TypeDef* USARTx,unsigned int u32tempdat) //USART1~UART5   u32tempdat：0~4294967296
{
	  unsigned char temp[11],i;
		unsigned int gg;
		gg=u32tempdat;
	  temp[0]='\0';//为了符合字符串输出函数结束符
	  i=1;		
		while((gg/10) != 0)
		{
				 temp[i]=gg%10+48;
				 gg=gg/10;
				 i++;
		}
	 temp[i]=gg%10+48; //ASCALL character code conversion
	
	 for(;i>0;i--)
	 {
	     UART_send_char(USARTx,temp[i]);
   }
}

/****************************************************************
  *
  * 函数名：   UART_send_string
	* 函数功能： 字符串发送函数
  *
  * 参数说明：  USARTx:  
  *    					USART1, USART2, USART3, UART4 or UART5.
  *   
  * 备注：  CRP
  *  
  ****************************************************************/
void UART_send_string(USART_TypeDef* USARTx,char *buf)
{
	while(*buf!='\0')
	{
		 USART_SendData(USARTx,*buf++);
	   while (USART_GetFlagStatus(USARTx,USART_FLAG_TXE) == RESET); 
	}
}
/****************************************************************
  *
  * 函数名：   UART_send_buffer
	* 函数功能： 字符串发送函数
  *
  * 参数说明：  USARTx:  
  *    					USART1, USART2, USART3, UART4 or UART5.
  *   
  * 备注：  CRP
  *  
  ****************************************************************/
void UART_send_buffer(USART_TypeDef* USARTx,unsigned char *buf,unsigned int len)
{
	unsigned int j=0;
	for(j=0;j<len;j++)
	{
	 USART_SendData(USARTx,*buf++);
	 while (USART_GetFlagStatus(USARTx,USART_FLAG_TXE) == RESET); 
	}
}
/****************************************************************
  *
  * 函数名：   UART_send_char
	* 函数功能： 字符发送函数
  *
  * 参数说明：  USARTx:  
  *    					USART1, USART2, USART3, UART4 or UART5.
  *   
  * 备注： CRP
  *  
  ****************************************************************/
void UART_send_char(USART_TypeDef* USARTx,char buf)
{
	 
		 USART_SendData(USARTx,buf);
	   while (USART_GetFlagStatus(USARTx,USART_FLAG_TXE) == RESET); 
	 
}
//重定向c库函数printf到串口，重定向后可使用printf函数
int fputc(int ch, FILE *f)
{
		/* 发送一个字节数据到串口 */
		USART_SendData(USART2, (uint8_t) ch);
		
		/* 等待发送完毕 */
		while (USART_GetFlagStatus(USART2, USART_FLAG_TXE) == RESET);		
	
		return (ch);
}

//重定向c库函数scanf到串口，重写向后可使用scanf、getchar等函数
int fgetc(FILE *f)
{
		/* 等待串口输入数据 */
		while (USART_GetFlagStatus(USART2, USART_FLAG_RXNE) == RESET);

		return (int)USART_ReceiveData(USART2);
}

